In [27]:
import io
import pandas as pd

In [28]:
data = u"""name|age|height|class|score
lily|28|168|english|90
lily|28|168|math|95
lucy|28|120|english|99
lucy|28|120|math|88
sun|27|161|english|98
sun|27|161|math|78
vincent|32|175|english|60
vincent|32|175|math|100
"""
d = pd.read_table(io.StringIO(data),sep='|')

In [29]:
d

      name  age  height    class  score
0     lily   28     168  english     90
1     lily   28     168     math     95
2     lucy   28     120  english     99
3     lucy   28     120     math     88
4      sun   27     161  english     98
5      sun   27     161     math     78
6  vincent   32     175  english     60
7  vincent   32     175     math    100

In [30]:
ng = d.groupby(["name","age","height"])

In [31]:
ng.describe()
ng.max()

                   class  score
name    age height
lily    28  168     math     95
lucy    28  120     math     99
sun     27  161     math     98
vincent 32  175     math    100

In [32]:
d.groupby("name").max()

         age  height class  score
name
lily      28     168  math     95
lucy      28     120  math     99
sun       27     161  math     98
vincent   32     175  math    100

In [33]:
d

      name  age  height    class  score
0     lily   28     168  english     90
1     lily   28     168     math     95
2     lucy   28     120  english     99
3     lucy   28     120     math     88
4      sun   27     161  english     98
5      sun   27     161     math     78
6  vincent   32     175  english     60
7  vincent   32     175     math    100